# Brewfile for managing Homebrew packages
# Install with: brew bundle
# Update with: brew bundle dump --force

# CLI Tools - System Utilities
brew "bash"
brew "bash-completion@2"
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "moreutils"
brew "openssh"
brew "openssl"

# Brew
brew "bat"
brew "btop"
brew "curl"
brew "fd"
brew "fzf"
brew "git"
brew "git-lfs"
brew "jq"
brew "mise"
brew "neovim"
brew "ripgrep"
brew "rsync"
brew "ssh-copy-id"
brew "stow"
brew "tailscale"
brew "tealdeer"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "yq"

# Cask
cask "font-meslo-lg-nerd-font"
cask "ghostty"
cask "firefox"
cask "vlc"
cask "wireshark-app"
cask "moonlight"

# Mac only
brew "reattach-to-user-namespace"
brew "mas"
cask "rectangle"
cask "macvim-app"
cask "stats"
