# Tools
brew "cloud-sql-proxy"
brew "golangci-lint"
brew "trufflehog"
cask "gcloud-cli"
cask "orbstack"
# Go Tools
go "cmd/go"
go "cmd/gofmt"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"

# VSCode Extensions
vscode "akamud.vscode-theme-onelight"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-containers"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "enkia.tokyo-night"
vscode "golang.go"
vscode "jdinhlife.gruvbox"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.makefile-tools"
vscode "rooveterinaryinc.roo-cline"
vscode "t3dotgg.vsc-material-theme-but-i-wont-sue-you"
vscode "vscodevim.vim"
vscode "zhuangtongfa.material-theme"
