# Brewfile for managing Homebrew packages
# Install with: brew bundle
# Update with: brew bundle dump --force

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"

# CLI Tools - System Utilities
brew "bash"
brew "bash-completion@2"
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "moreutils"
brew "openssh"
brew "openssl"
brew "rsync"
brew "watch"
brew "wget"

# CLI Tools - File & Text Processing
brew "bat"
brew "csvkit"
brew "exiftool"
brew "fd"
brew "fzf"
brew "jq"
brew "pup"
brew "ripgrep"
brew "tree"
brew "yq"

# CLI Tools - System Monitoring & Network
brew "btop"
brew "duf"
brew "htop"
brew "mtr"
brew "netcat"
brew "nmap"

# CLI Tools - Development & Version Control
brew "git"
brew "git-lfs"
brew "gh"
brew "just"
brew "mise"
brew "rust"

# CLI Tools - Infrastructure & Cloud
brew "ansible"
brew "k9s"
brew "stern"
brew "tailscale"

# CLI Tools - Media & Files
brew "ffmpeg"
brew "yt-dlp"

# CLI Tools - Databases
brew "postgresql@13"
brew "postgresql@14"
brew "sqlite"

# CLI Tools - Editors & Terminal
brew "neovim"
brew "vim"
brew "tmux"
brew "reattach-to-user-namespace"
brew "stow"

# CLI Tools - Other
brew "curl"
brew "ext2fuse"
brew "ext4fuse"
brew "fastfetch"
brew "ollama"
brew "qmk"
brew "ssh-copy-id"
brew "tealdeer"

# Cask Applications - Development
cask "ghostty"
cask "macvim"

# Cask Applications - Utilities
cask "firefox"
cask "rectangle"
cask "vlc"
cask "wireshark-app"

# Cask Applications - other
cask "moonlight"
cask "stats"
